plantalog/cadi-gcl/stm32f407/main.c
	RCC->APB2ENR |= RCC_APB2ENR_ADC1EN; //Ð¿Ð¾Ð´Ð°ÐµÐ¼ Ñ‚Ð°ÐºÑ‚Ð¸Ñ€Ð¾Ð²Ð°Ð½Ð¸Ðµ Ð�Ð¦ÐŸ
	ADC1->CR1 = 0; //
	ADC1->CR2 = 0; //
	ADC1->JSQR = 0;

	ADC1->CR2 = ADC_CR2_JEXTSEL; //Ð²Ñ‹Ð±Ñ€Ð°Ñ‚ÑŒ Ð¸Ñ�Ñ‚Ð¾Ñ‡Ð½Ð¸ÐºÐ¾Ð¼ Ð·Ð°Ð¿ÑƒÑ�ÐºÐ° Ñ€Ð°Ð·Ñ€Ñ�Ð´ JSWSTART
	ADC1->CR2 |= ADC_CR2_CONT; //Ñ€ÐµÐ¶Ð¸Ð¼ Ð½ÐµÐ¿Ñ€ÐµÑ€Ñ‹Ð²Ð½Ð¾Ð³Ð¾ Ð¿Ñ€ÐµÐ¾Ð±Ñ€Ð°Ð·Ð¾Ð²Ð°Ð½Ð¸Ñ�
	ADC1->CR1 |= ADC_CR1_SCAN; //Ñ€ÐµÐ¶Ð¸Ð¼ Ñ�ÐºÐ°Ð½Ð¸Ñ€Ð¾Ð²Ð°Ð½Ð¸Ñ� (Ñ‚.Ðµ. Ð½ÐµÑ�ÐºÐ¾Ð»ÑŒÐºÐ¾ ÐºÐ°Ð½Ð°Ð»Ð¾Ð²)
	ADC1->CR1 |= ADC_CR1_JAUTO; //Ð°Ð²Ñ‚Ð¾Ð¼Ð°Ñ‚. Ð·Ð°Ð¿ÑƒÑ�Ðº Ð¸Ð½Ð¶ÐµÐºÑ‚Ð¸Ñ€Ð¾Ð²Ð°Ð½Ð½Ð¾Ð¹ Ð³Ñ€ÑƒÐ¿Ð¿Ñ‹
	ADC1->JSQR = ((4-1)<<20); //number of channels in injected group
	ADC1->JSQR |= (0<<(5*3)); //ch. number for first conversion
	ADC1->JSQR |= (1<<(5*2)); //ch. number for 2nd conversion
	ADC1->JSQR |= (2<<(5*1)); //ch. number for 2nd conversion
	ADC1->JSQR |= (3<<(5*0)); //ch. number for 2nd conversion

	ADC1->CR2 |= ADC_CR2_ADON; //enable ADC
	ADC1->CR2 |= ADC_CR2_JSWSTART; //start conversion
}

void adc_read(void){
	ADC1->CR2 |= ADC_CR2_JSWSTART;
	while (!(ADC1->SR & ADC_SR_JEOC));
}

extern void RTC_WKUP_IRQHandler(void)
{
  if(RTC_GetITStatus(RTC_IT_WUT) != RESET)
  {
    /* Toggle on LED1 */
//    STM_EVAL_LEDToggle(LED1);
    RTC_ClearITPendingBit(RTC_IT_WUT);
    EXTI_ClearITPendingBit(EXTI_Line22);
  }
}

/**
  * @brief  This function handles TIM5 global interrupt request.
  * @param  None
  * @retval None
  */
extern void TIM5_IRQHandler(void)
{
  if (TIM_GetITStatus(TIM5, TIM_IT_CC4) != RESET)
  {
    /* Get the Input Capture value */
//    tmpCC4[uwCaptureNumber++] = TIM_GetCapture4(TIM5);

    /* Clear CC4 Interrupt pending bit */
    TIM_ClearITPendingBit(TIM5, TIM_IT_CC4);

 //   if (uwCaptureNumber >= 2)
 //   {
      /* Compute the period length */
 //     uwPeriodValue = (uint16_t)(0xFFFF - tmpCC4[0] + tmpCC4[1] + 1);
//    }
  }
}


void vTaskLED5(void *pvParameters);
void vTaskLED6(void *pvParameters);
void vTaskLCDdraw(void *pvParameters);
void vTaskSonar(void *pvParameters);
void vTaskReadButtons(void *pvParameters);
void vTaskDHT(void *pvParameters);
void vTaskSDLog(void *pvParameters);
void vTaskProgramRunner(void *pvParameters);

void init_gpio(void){	// do we need it?
	 GPIO_InitTypeDef gpio_cfg,GPIO_InitStructure;
	  GPIO_StructInit(&gpio_cfg);

	  // vyvod ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¨trigÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¨ signala
	  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOB, ENABLE);		// PB13
	  gpio_cfg.GPIO_Mode = GPIO_Mode_OUT;
	  gpio_cfg.GPIO_OType = GPIO_OType_PP;
	  gpio_cfg.GPIO_PuPd = GPIO_PuPd_UP;
	  gpio_cfg.GPIO_Pin = GPIO_Pin_13;
	  GPIO_Init(GPIOB, &gpio_cfg);

	  // TIM5 na PA3 dlja lovli "echo" s podschetom ego dliny
	  GPIO_InitStructure.GPIO_Pin =  GPIO_Pin_11;
	  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
	  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
	  GPIO_Init(GPIOB, &GPIO_InitStructure);
}

void dht_init(void){
	  GPIO_InitTypeDef GPIO_InitStructure;
	  NVIC_InitTypeDef NVIC_InitStructure;

	  /* TIM4 clock enable */
	  RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM4, ENABLE);

	  /* GPIOB clock enable */
	  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOB, ENABLE);

	  /* TIM4 chennel2 configuration : PB.07 */
	  GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_7;
	  GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AF;
	  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;
	  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	  GPIO_InitStructure.GPIO_PuPd  = GPIO_PuPd_UP ;
	  GPIO_Init(GPIOB, &GPIO_InitStructure);

	  // CARD SELECT for SD card	// chto za porno????
	  GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_5;
	  GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_OUT;
	  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;
	  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	  GPIO_InitStructure.GPIO_PuPd  = GPIO_PuPd_UP ;
	  GPIO_Init(GPIOB, &GPIO_InitStructure);

	  /* Connect TIM pin to AF2 */
	  GPIO_PinAFConfig(GPIOB, GPIO_PinSource7, GPIO_AF_TIM4);

	  /* Enable the TIM4 global Interrupt */
	  NVIC_InitStructure.NVIC_IRQChannel = TIM4_IRQn;
	  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
	  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
	  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	  NVIC_Init(&NVIC_InitStructure);
	TIM_ICInitStructure.TIM_Channel = TIM_Channel_2;
	  TIM_ICInitStructure.TIM_ICPolarity = TIM_ICPolarity_Rising;
	  TIM_ICInitStructure.TIM_ICSelection = TIM_ICSelection_DirectTI;
	  TIM_ICInitStructure.TIM_ICPrescaler = TIM_ICPSC_DIV1;
	  TIM_ICInitStructure.TIM_ICFilter = 0x0;

	  TIM_PWMIConfig(TIM4, &TIM_ICInitStructure);

	  /* Select the TIM4 Input Trigger: TI2FP2 */
	  TIM_SelectInputTrigger(TIM4, TIM_TS_TI2FP2);

	  /* Select the slave Mode: Reset Mode */
	  TIM_SelectSlaveMode(TIM4, TIM_SlaveMode_Reset);
	  TIM_SelectMasterSlaveMode(TIM4,TIM_MasterSlaveMode_Enable);

	  /* Enable the CC2 Interrupt Request */
	  TIM_ITConfig(TIM4, TIM_IT_CC2, ENABLE);
	  /* TIM enable counter */
	  TIM_Cmd(TIM4, ENABLE);

}

void dht_init_out(void){	// init GPIO pin as OUTput
	 GPIO_InitTypeDef gpio_cfg,GPIO_InitStructure;
	  GPIO_StructInit(&gpio_cfg);

	  // vyvod ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¨trigÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¨ signala
	  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOB, ENABLE);		// PB13
	  gpio_cfg.GPIO_Mode = GPIO_Mode_OUT;
	  gpio_cfg.GPIO_OType = GPIO_OType_PP;
	  gpio_cfg.GPIO_PuPd = GPIO_PuPd_UP;
	  gpio_cfg.GPIO_Pin = GPIO_Pin_7;
	  GPIO_Init(GPIOB, &gpio_cfg);
}

void dht_conv_data(void){ // convert DHT impulse lengths array into numbers and strings of T and rH
	uint8_t i, i2;
	uint16_t caps1[45], caps2[45];
	uint16_t zero_ticks, one_ticks;
	vTaskDelay(10);
	if (dht_bit_ready==1) {
		int dht_buf_pointer=DHT_DATA_START_POINTER;	// points the dht data start bit
		for (i=0;i<45;i++) {
			caps1[i]=dht_bit_array[i];
		}
		dht_data_ready = 0;
		for (i=0; i<5; i++){
			dht_data[i]=0;
			vTaskDelay(10);
			for (i2=8; i2>0; i2--) {
				if (caps1[dht_buf_pointer]>40 && caps1[dht_buf_pointer]<80) {
					dht_data[i] |= (1<<(i2-1)); // set i2 bit in dht_data[i]
				}
				dht_buf_pointer++;
			}
		}
		vTaskDelay(10);

