plantalog/cadi-gcl/stm32f407/main.c
void sonar_init(){
	GPIO_InitTypeDef gpio_cfg;
	 GPIO_StructInit(&gpio_cfg);

	 RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2, ENABLE);
	 RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOB, ENABLE);

	 	// PB13
	 gpio_cfg.GPIO_Mode = GPIO_Mode_OUT;
	 gpio_cfg.GPIO_OType = GPIO_OType_PP;
	 gpio_cfg.GPIO_PuPd = GPIO_PuPd_UP;
	 gpio_cfg.GPIO_Pin = GPIO_Pin_13;
	 GPIO_Init(GPIOB, &gpio_cfg);

	 // TIM2 channel 4 pin (PB.11) configuration as PWM input
	 GPIO_InitStructure.GPIO_Pin =  GPIO_Pin_11;
	 GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
	 GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	 GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	 GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
	 GPIO_Init(GPIOB, &GPIO_InitStructure);

	 GPIO_PinAFConfig(GPIOB, GPIO_PinSource11,GPIO_AF_TIM2);
	 /* Connect TIM pins to AF2 */


	   /* Enable the TIM2 global Interrupt */
	   NVIC_InitStructure.NVIC_IRQChannel = EXTI15_10_IRQn;
	   NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
	   NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
	   NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	   NVIC_Init(&NVIC_InitStructure);

	   TIM_ICStructInit(&TIM_ICInitStructure);
	   TIM_ICInitStructure.TIM_Channel = TIM_Channel_4;
	   TIM_ICInitStructure.TIM_ICPolarity = TIM_ICPolarity_Rising;
	   TIM_ICInitStructure.TIM_ICSelection = TIM_ICSelection_DirectTI;
	   TIM_ICInitStructure.TIM_ICPrescaler = TIM_ICPSC_DIV1;
	   TIM_ICInitStructure.TIM_ICFilter = 0x0;
	   // TIM enable counter
	   TIM_ICInit(TIM2, &TIM_ICInitStructure);
	   TIM_Cmd(TIM2, ENABLE);
	   TIM_ITConfig(TIM2, TIM_IT_CC4, ENABLE);
	   NVIC_EnableIRQ(TIM2_IRQn);

	   RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG, ENABLE);
		   /* Connect "echo" EXTI Line to "echo" GPIO Pin */
	   SYSCFG_EXTILineConfig(EXTI_PortSourceGPIOB, EXTI_PinSource11);

		   // Configure "echo" EXTI line
	   EXTI_InitStructure.EXTI_Line = EXTI_Line11;
	   EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
	   EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Falling;
	   EXTI_InitStructure.EXTI_LineCmd = ENABLE;
	   EXTI_Init(&EXTI_InitStructure);
	   NVIC_EnableIRQ(EXTI15_10_IRQn);
}


void sonar_trig(){	// send the signal to sonar to measure the distance
	GPIOB->BSRRL |= GPIO_Pin_13;
	vTaskDelay(10);
	GPIOB->BSRRH |= GPIO_Pin_13;
	vTaskDelay(20);
}

int main(void)
{
	RTC_TimeTypeDef RTC_TimeStructure;
	RTC_DateTypeDef RTC_DateStructure;
	dht_init();
	buttonsInit();
int	del=1000*SPEED_K; while (del--){}
	uint8_t i=0, res=0;
	uint16_t i2;
	for (i=0; i<16; i++) {
		LCDLine1[i] = 32;
	}
	for (i=0; i<16; i++) {
		LCDLine2[i] = 32;
	}
	FLASH_Unlock();
	EE_Init();
	sonar_init();
	rtc_init();
	  /* Set the date: Sunday April 21st 2013 */
	  RTC_DateStructure.RTC_Year = 0x13;
	  RTC_DateStructure.RTC_Month = RTC_Month_April;
	  RTC_DateStructure.RTC_Date = 0x21;
	  RTC_DateStructure.RTC_WeekDay = RTC_Weekday_Sunday;
	  RTC_SetDate(RTC_Format_BCD, &RTC_DateStructure);

	  /* Set the time to 20h 52mn 00s  */
	  RTC_TimeStructure.RTC_Hours   = 0x20;
	  RTC_TimeStructure.RTC_Minutes = 0x52;
	  RTC_TimeStructure.RTC_Seconds = 0x00;

	  RTC_SetTime(RTC_Format_BCD, &RTC_TimeStructure);
	Init_lcd();
	uint16_t	tmpvar=0;
	Lcd_goto(0,0);
	Lcd_write_str("sd test");

	no_sd = disk_initialize(0);
	no_sd = f_mount(0, &fs);              // mount file system

	char FileName[]="0:CADIZLOG";  //Ð¸Ð¼Ñ� Ð»Ð¾Ð³ Ñ„Ð°Ð¹Ð»Ð°
	res = f_open(&cadizlog, FileName, FA_WRITE | FA_READ);
	if(res) {
		res = f_open(&cadizlog, FileName, FA_WRITE | FA_CREATE_ALWAYS);
		if(res) {
		  return res;    //ÐµÑ�Ð»Ð¸ Ð¿Ñ€Ð¾Ð¸Ð·Ð¾ÑˆÐ»Ð° Ð¾ÑˆÐ¸Ð±ÐºÐ°
		}
	}    //ÐµÑ�Ð»Ð¸ Ð¿Ñ€Ð¾Ð¸Ð·Ð¾ÑˆÐ»Ð° Ð¾ÑˆÐ¸Ð±ÐºÐ°
	f_lseek(&cadizlog, cadizlog.fsize);

		string2log("System started\n", 15);
		del=3000*SPEED_K; while (del--){}
		string2log("System startet\n", 15);
		del=3000*SPEED_K; while (del--){}

		buttonCalibration();



// blok proverki zapisi v emulated eeprom
	/*
	EE_WriteVariable(0xF000, 12321);
	EE_ReadVariable(0xF000, &tmpvar);
	Lcd_write_data((tmpvar%100000)/10000+48);
	Lcd_write_data((tmpvar%10000)/1000+48);
	Lcd_write_data((tmpvar%1000)/100+48);
	Lcd_write_data((tmpvar%100)/10+48);
	Lcd_write_data((tmpvar%10)+48); */

	del=1000*SPEED_K; while (del--){}

	STM32F4_Discovery_LEDInit(LED6);
	STM32F4_Discovery_LEDInit(LED5);

//	void vTaskDHT(void *pvParameters)
//	void vTaskProgramRunner(void *pvParameters)
	xTaskCreate( vTaskProgramRunner, ( signed char * ) "RUN", configMINIMAL_STACK_SIZE+100, NULL, 2, ( xTaskHandle * ) NULL);
	xTaskCreate( vTaskSDLog, ( signed char * ) "SDLOG", configMINIMAL_STACK_SIZE, NULL, 2, ( xTaskHandle * ) NULL);
	xTaskCreate( vTaskDHT, ( signed char * ) "DHT", configMINIMAL_STACK_SIZE, NULL, 2, ( xTaskHandle * ) NULL);
	xTaskCreate( vTaskReadButtons, ( signed char * ) "BTNS", configMINIMAL_STACK_SIZE, NULL, 2, ( xTaskHandle * ) NULL);
	xTaskCreate( vTaskLED5, ( signed char * ) "LED5", configMINIMAL_STACK_SIZE, NULL, 2, ( xTaskHandle * ) NULL);
	xTaskCreate( vTaskLED6, ( signed char * ) "LED6", configMINIMAL_STACK_SIZE, NULL, 2, ( xTaskHandle * ) NULL);
	xTaskCreate( vTaskLCDdraw, ( signed char * ) "LCD", configMINIMAL_STACK_SIZE, NULL, 2, ( xTaskHandle * ) NULL);
	xTaskCreate( vTaskSonar, ( signed char * ) "SONAR", configMINIMAL_STACK_SIZE, NULL, 2, ( xTaskHandle * ) NULL);
	vTaskStartScheduler();
}

void vTaskReadButtons(void *pvParameters) {
	uint16_t curval = 0, avg=0;
	uint8_t i;
	for (;;) {
		adc_read();
		vTaskDelay(10);
//		buttonBuffer = 0;
		// filtering algorithm
/*		avg = 0;
		for(i=0; i < 9; i++) {
			avg += buttonBuffer[i];
			buttonBuffer[i] = buttonBuffer[i+1];
		}
		avg += buttonBuffer[9];
		avg /= 10;
		buttonBuffer[9] = JDR_BUTTONS; */

		curval = JDR_BUTTONS;
		button_code = 0;
		for (i=0;i<4;i++) {
			if (curval>button_ranges[i*2] && curval<button_ranges[i*2+1]) {
				button_code = i+1;
			}
		}
	}
}

extern void TIM2_IRQHandler(void)
{
    capture1 = TIM_GetCapture4(TIM2);
    capture_is_ready = 0;
    TIM_ClearITPendingBit(TIM2, TIM_IT_CC3);

