plantalog/cadi-gcl/stm32f407/main.c
}

extern void EXTI15_10_IRQHandler(void)
{
	capture2 = TIM2->CNT;
	capture_is_ready = 1;
    EXTI_ClearITPendingBit(EXTI_Line11);
}

void monitorDisplayer(void){
	uint8_t i, prevseconds=0;
	// --- main monitor mode programm ---
	// display temperature and humidity data
    for (i=0;i<4;i++){
      LCDLine1[i] = dht_t_str[i];
    }
    for (i=0;i<4;i++){
      LCDLine1[i+5] = dht_rh_str[i];
    }
	    // sonar data
    for (i=0;i<3;i++){
     LCDLine1[i+11] = sonar_str[i];
    }
    // "mm" for sonar
    LCDLine1[14]=109;
    LCDLine1[15]=109;
	    // button code
    LCDLine1[9] = button_code+48;
	    // date and time
    RTC_GetTime(RTC_Format_BIN, &curtime);
    RTC_GetDate(RTC_Format_BIN, &curdate);
    if (curtime.RTC_Seconds!=prevseconds) {
    	prevseconds=curtime.RTC_Seconds;
    	rtc_time_now_str[0] = (curtime.RTC_Hours%100)/10+48;
    	rtc_time_now_str[1] = curtime.RTC_Hours%10+48;
    	rtc_time_now_str[2] = 58;
    	rtc_time_now_str[3] = (curtime.RTC_Minutes%100)/10+48;
    	vTaskDelay(5);
    	rtc_time_now_str[4] = curtime.RTC_Minutes%10+48;
    	rtc_time_now_str[5] = 58;
    	rtc_time_now_str[6] = (curtime.RTC_Seconds%100)/10+48;
    	rtc_time_now_str[7] = curtime.RTC_Seconds%10+48;
    	vTaskDelay(5);
    	rtc_time_now_str[8] = (curdate.RTC_Date%100)/10+48;
    	rtc_time_now_str[9] = curdate.RTC_Date%10+48;
    	rtc_time_now_str[10] = 45;
    	rtc_time_now_str[11] = (curdate.RTC_Month%100)/10+48;
    	vTaskDelay(5);
    	rtc_time_now_str[12] = curdate.RTC_Month%10+48;
    	rtc_time_now_str[13] = 45;
    	rtc_time_now_str[14] = (curdate.RTC_Year%100)/10+48;
    	rtc_time_now_str[15] = curdate.RTC_Year%10+48;
  		}
}

void vTaskProgramRunner(void *pvParameters){
	uint8_t prevseconds = 0, i;
	while (1){

		monitorDisplayer();

		if (button_code==BUTTON_OK)
		{
			vTaskDelay(100);
			Lcd_clear();
			vTaskDelay(500);
			uint8_t progId=menuSelector();
			programRunner(progId);
		}
		vTaskDelay(10);
	}
}

void vTaskLCDdraw(void *pvParameters) {	// draws lcd
	uint32_t tmp=0;
	uint8_t button=0;
//	RTC_TimeTypeDef curtime;
//	RTC_TimeStructInit(&curtime);
	for (;;) {
//		Lcd_write_cmd(Display_clear);
//		adc_read();
		Lcd_goto(0,0);
		vTaskSuspendAll();
		Lcd_write_arr(&LCDLine1, 16);
		Lcd_goto(1,0);
		Lcd_write_arr(&LCDLine2, 16);
		xTaskResumeAll();

		vTaskDelay(17);
		// 26.06.2013
//		button=readButtons();
	}
}



uint16_t del;
void vTaskLED5(void *pvParameters) {
	for (;;) {
		STM32F4_Discovery_LEDOn(LED5);
		vTaskDelay(5);
		STM32F4_Discovery_LEDOff(LED5);
		del = 65-sonar_value/1000;
		vTaskDelay(del);
	}
}

void vTaskLED6(void *pvParameters) {
	uint8_t i=0, prevseconds=0;
	for (;;) {
		STM32F4_Discovery_LEDOn(LED6);
		vTaskDelay(2);
		STM32F4_Discovery_LEDOff(LED6);
		vTaskDelay(2);
		RTC_GetTime(RTC_Format_BIN, &curtime);
		RTC_GetDate(RTC_Format_BIN, &curdate);
		vTaskDelay(5);
		if (curtime.RTC_Seconds!=prevseconds) {
			prevseconds=curtime.RTC_Seconds;
			rtc_time_now_str[0] = (curtime.RTC_Hours%100)/10+48;
			rtc_time_now_str[1] = curtime.RTC_Hours%10+48;
			rtc_time_now_str[2] = 58;
			rtc_time_now_str[3] = (curtime.RTC_Minutes%100)/10+48;
			vTaskDelay(5);
			rtc_time_now_str[4] = curtime.RTC_Minutes%10+48;
			rtc_time_now_str[5] = 58;
			rtc_time_now_str[6] = (curtime.RTC_Seconds%100)/10+48;
			rtc_time_now_str[7] = curtime.RTC_Seconds%10+48;
			vTaskDelay(5);
			rtc_time_now_str[8] = (curdate.RTC_Date%100)/10+48;
			rtc_time_now_str[9] = curdate.RTC_Date%10+48;
			rtc_time_now_str[10] = 45;
			rtc_time_now_str[11] = (curdate.RTC_Month%100)/10+48;
			vTaskDelay(5);
			rtc_time_now_str[12] = curdate.RTC_Month%10+48;
			rtc_time_now_str[13] = 45;
			rtc_time_now_str[14] = (curdate.RTC_Year%100)/10+48;
			rtc_time_now_str[15] = curdate.RTC_Year%10+48;

		}
		vTaskDelay(5);
		for (i=0;i<16;i++) {
			LCDLine2[i]=rtc_time_now_str[i];
		}
	}
}

uint16_t uint16_time_diff(uint16_t now, uint16_t before)
{
  return (now >= before) ? (now - before) : (UINT16_MAX - before + now);
}

void vTaskDHT(void *pvParameters){
	uint8_t i=0;
	dht_bit_position=0;
	while (1) {
		dht_get_data();
		vTaskDelay(30);
	}
}

void vTaskSDLog(void *pvParameters){
	while (1){
		vTaskDelay(200);
		logString[0] = (curtime.RTC_Hours%100)/10+48;
		logString[1] = curtime.RTC_Hours%10+48;
		logString[2] = 58;
		logString[3] = (curtime.RTC_Minutes%100)/10+48;
		vTaskDelay(5);
		logString[4] = curtime.RTC_Minutes%10+48;
		logString[5] = 58;
		logString[6] = (curtime.RTC_Seconds%100)/10+48;
		logString[7] = curtime.RTC_Seconds%10+48;
		logString[8] = 32;
		vTaskDelay(5);
		logString[9] = (curdate.RTC_Date%100)/10+48;
		logString[10] = curdate.RTC_Date%10+48;
		logString[11] = 45;
		logString[12] = (curdate.RTC_Month%100)/10+48;
		vTaskDelay(5);
		logString[13] = curdate.RTC_Month%10+48;
		logString[14] = 45;
		logString[15] = (curdate.RTC_Year%100)/10+48;
		logString[16] = curdate.RTC_Year%10+48;
		logString[17] = 32;
		copy_arr(&sonar_str, &logString, 5, 18);
		logString[23] = 32;
		copy_arr(&dht_rh_str, &logString, 4, 24);
		logString[28] = 32;
		copy_arr(&dht_t_str, &logString, 4, 29);
	    logString[33] = 10;		// LF perenos stroki
	    string2log(&logString, 34);
	}
}

void vTaskSonar(void *pvParameters){
	uint8_t	i=0;
	for (;;) {
		 sonar_trig();
		  vTaskDelay(10);
	      sonar_value = (65535-uint16_time_diff(capture1,capture2))/80; // get millimeters
	      sonar_str[0] = (sonar_value%1000)/100+48;
	      sonar_str[1] = (sonar_value%100)/10+48;
	      sonar_str[2] = (sonar_value%10)+48;
	      sonar_str[3] = 32;
	      vTaskDelay(10);
	}

}

void copy_arr(uint8_t *source, uint8_t *destination, uint8_t amount, uint8_t pos){
	int i=0;
	for (i=0; i<amount;i++) {
		destination[i+pos] = source[i];
	}
}


FRESULT string2log(char* str, int amount){
	uint8_t res=0;               //Ð´Ð»Ñ� Ð²Ð¾Ð·Ð²Ñ€Ð°Ñ‰Ð°ÐµÐ¼Ð¾Ð³Ð¾ Ñ„ÑƒÐ½ÐºÑ†Ð¸Ñ�Ð¼Ð¸ Ñ€ÐµÐ·ÑƒÐ»ÑŒÑ‚Ð°Ñ‚Ð°
	UINT len;                  //Ð´Ð»Ñ� Ñ…Ñ€Ð°Ð½ÐµÐ½Ð¸Ñ� ÐºÐ¾Ð»Ð¸Ñ‡ÐµÑ�Ñ‚Ð²Ð° Ñ€ÐµÐ°Ð»ÑŒÐ½Ð¾ Ð·Ð°Ð¿Ð¸Ñ�Ð°Ð½Ð½Ñ‹Ñ… Ð±Ð°Ð¹Ñ‚
	f_write(&cadizlog, str, amount, &len);
	f_sync(&cadizlog);
	return res;
}



void loadSettings(){	//
	uint16_t i, Address, Data;
	uint32_t tmp;
	char tmpstr[11], putstring[50];
//	char *massiv[];
	for (i=0; i<PLUG_AMOUNT; i++) {
		Address=EE_PLUG_SETTINGS+i;
		EE_ReadVariable(Address, &Data);
		plugSettings[i]=Data;
		if (no_sd>1) {
			string2log("plug no.", 8);
			int32str(i,&tmpstr);
			string2log(tmpstr, 11);
			string2log(" has timer no.", 14);
			int32str(plugSettings[i],&tmpstr);
			tmpstr[10] = 0x0A;
			string2log(tmpstr, 11);
		}
	}
	Address=LIGHT_RANGE_ADDR;
	EE_ReadVariable(Address, &lightRange);
	EE_ReadVariable(PH4_ADDR, &ph4);

//	Address=PH7_ADDR;
	EE_ReadVariable(PH7_ADDR, &ph_seven);
	cdel = (ph_seven - ph4)/3;
	ph0 = ph4 - cdel*4;

	if (no_sd>0) {
		// vnesti v log znachenie kalibrovshika ph4
		int32str(ph4,&tmpstr);
		for (i=0;i<10;i++){
			putstring[i]=tmpstr[i];
		}
		putstring[10] = 0x0A;
		string2log("ph4 cal @ ", 10);
		string2log(putstring, 11);

		// vnesti v log znachenie kalibrovshika ph7
		int32str(ph_seven,&tmpstr);
		for (i=0;i<10;i++){
			putstring[i]=tmpstr[i];
		}
		putstring[10] = 0x0A;
		string2log("ph7 cal @ ", 10);
		string2log(putstring, 11);

		// vnesti v log raschitayj uroven' ph0
		int32str(ph0,&tmpstr);
		for (i=0;i<10;i++){
			putstring[i]=tmpstr[i];
		}
		putstring[14] = 10;
		string2log("ph0 counted @ ", 14);
		string2log(putstring, 11);

		// vnesti v log raschitanuju cenu delenija
		int32str(cdel,&tmpstr);
		for (i=0;i<10;i++){
			putstring[i]=tmpstr[i];
		}
		putstring[14] = 10;
		string2log("cena delenija ", 14);
		string2log(putstring, 11);
	}

	EE_ReadVariable(SD_LOG_INTERVAL, &logInterval);
}


char* int32str(uint32_t d, char* out)
{
    out[10] = '\0';
    out[9] = '0' + ( d       )    % 10;
    out[8] = '0' + ( d /= 10 )    % 10;
    out[7] = '0' + ( d /= 10 )    % 10;
    out[6] = '0' + ( d /= 10 )    % 10;
    out[5] = '0' + ( d /= 10 )    % 10;
    out[4] = '0' + ( d /= 10 )    % 10;
    out[3] = '0' + ( d /= 10 )    % 10;
    out[2] = '0' + ( d /= 10 )    % 10;
    out[1] = '0' + ( d /= 10 )    % 10;
    out[0] = '0' + ( d /  10 )    % 10;
    return out;
}

