plantalog/cadi-gcl/stm32f407/main.c
void buttonCalibration(void){	// buttons calibration function
	uint16_t button_val[4], diff;
	Lcd_clear();
	Lcd_goto(0,0);
	Lcd_write_arr("<", 1);
	Delay_us(30000);
	adc_read();
	Delay_us(100);
	button_val[0] = JDR_BUTTONS;
	Lcd_goto(0,0);
	Lcd_write_arr("OK", 2);
	Delay_us(30000);
	adc_read();
	Delay_us(100);
	button_val[1] = JDR_BUTTONS;
	Lcd_goto(0,0);
	Lcd_write_arr("CANCEL", 6);
	Delay_us(30000);
	adc_read();
	Delay_us(100);
	button_val[2] = JDR_BUTTONS;
	Lcd_goto(0,0);
	Lcd_write_arr(">", 1);
	Delay_us(30000);
	adc_read();
	Delay_us(100);
	button_val[3] = JDR_BUTTONS;

	if ((button_val[3]>>3)<(button_val[0]>>3)) {
		buttonReverse = 1;
	}
	else if ((button_val[3]>>3)>(button_val[0]>>3)) {
		buttonReverse = 0;
	}
	else {
		// loadButtonSettings();	// no key pressed, loading settings from EEPROM
		buttonReverse = 2;	//means loading button settings from EEPROM
	}
	if (buttonReverse == 0) {
		diff = ((button_val[1]-button_val[0])/2)-5;
		button_ranges[0] = button_val[0]-diff;
		button_ranges[1] = button_val[0]+diff;
		button_ranges[2] = button_val[1]-diff;
		diff = ((button_val[2]-button_val[1])/2)-5;
		button_ranges[3] = button_val[1]+diff;
		button_ranges[4] = button_val[2]-diff;
		diff = ((button_val[3]-button_val[2])/2)-5;
		button_ranges[5] = button_val[2]+diff;
		button_ranges[6] = button_val[3]-diff;
		button_ranges[7] = button_val[3]+diff;
		saveButtonRanges();
	}
	else if (buttonReverse == 1) {
		diff = ((button_val[0]-button_val[1])/2)-5;
		button_ranges[0] = button_val[0]-diff;
		button_ranges[1] = button_val[0]+diff;
		button_ranges[2] = button_val[1]-diff;
		diff = ((button_val[1]-button_val[2])/2)-5;
		button_ranges[3] = button_val[1]+diff;
		button_ranges[4] = button_val[2]-diff;
		diff = ((button_val[2]-button_val[3])/2)-5;
		button_ranges[5] = button_val[2]+diff;
		button_ranges[6] = button_val[3]-diff;
		button_ranges[7] = button_val[3]+diff;
		saveButtonRanges();
	}
	else {
		Lcd_write_str("EEPROM buttons");
		readButtonRanges();
		Delay_us(10000);
	}

	if (button_ranges[0]>button_ranges[8]) {
				buttonReverse=1;
	}
/*
	// print button ranges
	Lcd_clear();
	Lcd_goto(0,0);
	Lcd_write_str("1:");
	Lcd_write_digit(button_val[0]/100%100);
	Lcd_write_digit(button_val[0]%100);
	Lcd_write_str(";");
	Lcd_write_digit(button_ranges[0]/100%100);
	Lcd_write_digit(button_ranges[0]%100);
	Lcd_write_str("-");
	Lcd_write_digit(button_ranges[1]/100%100);
	Lcd_write_digit(button_ranges[1]%100);
//	Lcd_write_str(";");
	Lcd_goto(1,0);
	Lcd_write_str("2:");
	Lcd_write_digit(button_val[1]/100%100);
	Lcd_write_digit(button_val[1]%100);
	Lcd_write_str(";");
	Lcd_write_digit(button_ranges[2]/100%100);
	Lcd_write_digit(button_ranges[2]%100);
	Lcd_write_str("-");
	Lcd_write_digit(button_ranges[3]/100%100);
	Lcd_write_digit(button_ranges[3]%100);
	Delay_us(80000);
	Lcd_goto(0,0);
	Lcd_write_str("3:");
	Lcd_write_digit(button_val[2]/100%100);
	Lcd_write_digit(button_val[2]%100);
	Lcd_write_str(";");
	Lcd_write_digit(button_ranges[4]/100%100);
	Lcd_write_digit(button_ranges[4]%100);
	Lcd_write_str("-");
	Lcd_write_digit(button_ranges[5]/100%100);
	Lcd_write_digit(button_ranges[5]%100);
//	Lcd_write_str(";");
	Lcd_goto(1,0);
	Lcd_write_str("4:");
	Lcd_write_digit(button_val[3]/100%100);
	Lcd_write_digit(button_val[3]%100);
	Lcd_write_str(";");
	Lcd_write_digit(button_ranges[6]/100%100);
	Lcd_write_digit(button_ranges[6]%100);
	Lcd_write_str("-");
	Lcd_write_digit(button_ranges[7]/100%100);
	Lcd_write_digit(button_ranges[7]%100);
//	Lcd_write_str(";");
	Delay_us(80000);
*/

	Lcd_goto(0,0);
	Lcd_write_str("Complete");
}

void readButtonRanges(void){
	uint8_t i;
	for (i=0; i<8; i++) {
		EE_ReadVariable(BUTTON_RANGES_START_ADDR+i, &button_ranges[i]);
	}
}

void saveButtonRanges(void){
	uint8_t i;
	for (i=0; i<8; i++) {
		EE_WriteVariable(BUTTON_RANGES_START_ADDR+i, button_ranges[i]);
	}
}


void displayAdcValues(void){
	uint8_t button=0;
	Lcd_clear();
	while (button!=5){
		button=readButtons();
		Lcd_goto(0,0);
		Lcd_write_str("1:");
		Lcd_write_digit(ADC1->JDR1/100);
		Lcd_write_digit(ADC1->JDR1);
		Lcd_write_str(" 2:");
		Lcd_write_digit(ADC1->JDR2/100);
		Lcd_write_digit(ADC1->JDR2);
		Lcd_goto(1,0);
		Lcd_write_str("3:");
		Lcd_write_digit(ADC1->JDR3/100);
		Lcd_write_digit(ADC1->JDR3);
		Lcd_write_str(" 4:");
		Lcd_write_digit(ADC1->JDR4/100);
		Lcd_write_digit(ADC1->JDR4);
		vTaskDelay(20);
	}
	Lcd_clear();
}

void buttonCalibration2(void){	// buttons calibration function
	uint8_t i=0;
	uint16_t button_val[4], diff, delay;
	Lcd_clear();
	Lcd_goto(0,0);
	Lcd_write_str("Press button 1");
	Delay_us(30000);
	adc_read();
	Delay_us(100);
	button_val[0] = ADC1->JDR1;
	Lcd_goto(0,0);
	Lcd_write_str("Press button 2");
	Delay_us(30000);
	adc_read();
	Delay_us(100);
	button_val[1] = ADC1->JDR1;
	diff = ((button_val[1]-button_val[0])/2)-5;
	button_ranges[0] = button_val[0]-diff;
	button_ranges[1] = button_val[0]+diff;
	button_ranges[2] = button_val[1]-diff;
	Lcd_goto(0,0);
	Lcd_write_str("Press button 3");
	Delay_us(30000);
	adc_read();
	Delay_us(100);
	button_val[2] = ADC1->JDR1;
	diff = ((button_val[2]-button_val[1])/2)-5;
	button_ranges[3] = button_val[1]+diff;
	button_ranges[4] = button_val[2]-diff;
	Lcd_goto(0,0);
	Lcd_write_str("Press button 4");
	Delay_us(30000);
	adc_read();
	Delay_us(100);
	button_val[3] = ADC1->JDR1;
	diff = ((button_val[3]-button_val[2])/2)-5;
	button_ranges[5] = button_val[2]+diff;
	button_ranges[6] = button_val[3]-diff;
	button_ranges[7] = button_val[3]+diff;
	Lcd_goto(0,0);
	Lcd_write_str("Calib. Complete");
}


uint8_t readButtons(void){
	uint16_t curval = 0;
	uint8_t i;
//	adc_read();
//	Delay_us(100);
	curval = button_code;
	for (i=0;i<4;i++) {
		if (curval>button_ranges[i*2] && curval<button_ranges[i*2+1]) {
			return i+1;
		}
	}
	return 0;
}

uint32_t EE_ReadWord(uint16_t Address){
	uint16_t tmp, tmp2;
	uint32_t Data = 0;
	EE_ReadVariable(Address, &tmp);
	EE_ReadVariable(Address+1, &tmp2);
	Data = ((uint32_t)tmp << 16) + (uint32_t)tmp2;
	return Data;
}
